In [10]:
import numpy as np
import pandas as pd

pd.set_option("display.max.columns", None)
pd.set_option("display.precision", 2)

In [2]:
url =     'https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/nbaallelo.csv'
df = pd.read_csv(url)

In [6]:
df.dtypes

gameorder          int64
game_id           object
lg_id             object
_iscopy            int64
year_id            int64
date_game         object
seasongame         int64
is_playoffs        int64
team_id           object
fran_id           object
pts                int64
elo_i            float64
elo_n            float64
win_equiv        float64
opp_id            object
opp_fran          object
opp_pts            int64
opp_elo_i        float64
opp_elo_n        float64
game_location     object
game_result       object
forecast         float64
notes             object
dtype: object

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [9]:
df.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,elo_i,elo_n,win_equiv,opp_pts,opp_elo_i,opp_elo_n,forecast
count,126314.00,126314.0,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00
mean,31579.00,0.5,1988.20,43.53,0.06,102.73,1495.24,1495.24,41.71,102.73,1495.24,1495.24,0.50
std,18231.93,0.5,17.58,25.38,0.24,14.81,112.14,112.46,10.63,14.81,112.14,112.46,0.22
min,1.00,0.0,1947.00,1.00,0.00,0.00,1091.64,1085.77,10.15,0.00,1091.64,1085.77,0.02
25%,15790.00,0.0,1975.00,22.00,0.00,93.00,1417.24,1416.99,34.10,93.00,1417.24,1416.99,0.33
50%,31579.00,0.5,1990.00,43.00,0.00,103.00,1500.95,1500.95,42.11,103.00,1500.95,1500.95,0.50
75%,47368.00,1.0,2003.00,65.00,0.00,112.00,1576.06,1576.29,49.64,112.00,1576.06,1576.29,0.67
max,63157.00,1.0,2015.00,108.00,1.00,186.00,1853.10,1853.10,71.11,186.00,1853.10,1853.10,0.98

In [11]:
df.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.00,1293.28,40.29,NYK,Knicks,68,1300.00,1306.72,H,L,0.64,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.00,1306.72,41.71,TRH,Huskies,66,1300.00,1293.28,A,W,0.36,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.00,1309.65,42.01,NYK,Knicks,47,1306.72,1297.07,H,W,0.63,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.72,1297.07,40.69,CHS,Stags,63,1300.00,1309.65,A,L,0.37,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.00,1279.62,38.86,WSC,Capitols,50,1300.00,1320.38,H,L,0.64,NaN

In [45]:
df.index

RangeIndex(start=0, stop=126314, step=1)

In [46]:
df.keys()

Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes'],
      dtype='object')

In [47]:
df.columns

Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes'],
      dtype='object')

In [12]:
df.tail()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,82,1723.41,1704.39,60.31,GSW,Warriors,103,1790.96,1809.98,H,L,0.55,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,104,1809.98,1813.63,68.01,CLE,Cavaliers,91,1704.39,1700.74,H,W,0.77,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,1704.39,1700.74,60.01,GSW,Warriors,104,1809.98,1813.63,A,L,0.23,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,1700.74,1692.09,59.29,GSW,Warriors,105,1813.63,1822.29,H,L,0.48,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,1813.63,1822.29,68.52,CLE,Cavaliers,97,1700.74,1692.09,A,W,0.52,NaN

In [17]:
# select team_id, count(team_id)
# from df
# where fran_id = 'Lakers'
# group by team_id

df.loc[df["fran_id"] == "Lakers", "team_id"].value_counts()

team_id
LAL    5078
MNL     946
Name: count, dtype: int64

In [18]:
df.loc[df["team_id"] == "MNL", "date_game"].min()

'1/1/1949'

In [19]:
df.loc[df["team_id"] == "MNL", "date_game"].max()

'4/9/1959'

In [21]:
# select min(date_game), max(date_game)
# from df
# where team_id = 'MNL

df.loc[df["team_id"] == "MNL", "date_game"].agg(("min", "max"))

min    1/1/1949
max    4/9/1959
Name: date_game, dtype: object

In [20]:
df.loc[df["team_id"] == "MNL", "date_game"]

1136     11/4/1948
1152     11/6/1948
1159     11/9/1948
1170    11/11/1948
1183    11/13/1948
           ...
9701     3/19/1960
9702     3/20/1960
9709     3/22/1960
9711     3/24/1960
9715     3/26/1960
Name: date_game, Length: 946, dtype: object

In [30]:
# select min(date_game), max(date_game)
# from df
# where team_id = 'MNL

df.loc[df["team_id"] == "MNL", "pts"].agg(("min", "max", "median", "mean", "std", "sum", "count"))

min          18.00
max         139.00
median       93.00
mean         93.27
std          15.43
sum       88229.00
count       946.00
Name: pts, dtype: float64

In [31]:
# select min(date_game), max(date_game)
# from df
# where team_id = 'MNL

df.loc[df["team_id"] == "MNL", "pts"].describe()

count    946.00
mean      93.27
std       15.43
min       18.00
25%       83.00
50%       93.00
75%      104.00
max      139.00
Name: pts, dtype: float64

In [32]:
df.loc[df["team_id"] == "MNL", "date_game"].describe()

count           946
unique          946
top       11/4/1948
freq              1
Name: date_game, dtype: object

In [33]:
df.loc[df["team_id"] == "MNL", "date_game"]

Index([1136, 1152, 1159, 1170, 1183, 1193, 1202, 1217, 1229, 1234,
       ...
       9679, 9682, 9684, 9693, 9695, 9701, 9702, 9709, 9711, 9715],
      dtype='int64', length=946)

In [52]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [53]:
city_revenues.loc["Toronto"]

8000

In [54]:
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [55]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [56]:
df.keys()

Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes'],
      dtype='object')

In [57]:
"gameord" in df.columns

False

In [58]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [59]:
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [60]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})

In [61]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [65]:
"Amsterdam" in city_data.columns

False

In [63]:
"Amsterdam" in city_data.index

True

In [67]:
test = df.loc[df["team_id"] == "MNL", "date_game"]

In [68]:
test

1136     11/4/1948
1152     11/6/1948
1159     11/9/1948
1170    11/11/1948
1183    11/13/1948
           ...
9701     3/19/1960
9702     3/20/1960
9709     3/22/1960
9711     3/24/1960
9715     3/26/1960
Name: date_game, Length: 946, dtype: object

In [69]:
test.iloc[0]

'11/4/1948'

In [71]:
test.iloc[1136]

IndexError: single positional indexer is out-of-bounds

In [70]:
test.loc[0]

KeyError: 0

In [74]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [75]:
city_revenues["Toronto"]

8000

In [77]:
city_revenues.iloc["Toronto"]

8000

In [79]:
city_revenues.iloc[1]

8000

In [80]:
city_revenues.iloc[1:]

Toronto    8000
Tokyo      6500
dtype: int64

In [82]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [83]:
city_revenues.iloc[1:]

Toronto    8000
Tokyo      6500
dtype: int64

In [85]:
city_revenues.iloc[0:]

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [88]:
city_revenues["Toronto":]

Toronto    8000
Tokyo      6500
dtype: int64

In [91]:
city_revenues.iloc[1:]

Toronto    8000
Tokyo      6500
dtype: int64

In [98]:
test

2       11/4/1948
3       11/6/1948
4       11/9/1948
5      11/11/1948
6      11/13/1948
          ...
943     3/19/1960
944     3/20/1960
945     3/22/1960
946     3/24/1960
947     3/26/1960
Name: date_game, Length: 946, dtype: object

In [100]:
test.iloc[2]

'11/9/1948'

In [101]:
test.loc[2]

'11/4/1948'

In [102]:
test[2]

'11/4/1948'

In [103]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)

In [104]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [107]:
city_data["employee_count"]

Amsterdam    5.0
Tokyo        8.0
Toronto      NaN
Name: employee_count, dtype: float64

In [110]:
city_data.loc["Tokyo":]

         revenue  employee_count
Tokyo       6500             8.0
Toronto     8000             NaN

In [112]:
city_data.employee_count

Amsterdam    5.0
Tokyo        8.0
Toronto      NaN
Name: employee_count, dtype: float64

In [113]:
city_data["employee_count"]

Amsterdam    5.0
Tokyo        8.0
Toronto      NaN
Name: employee_count, dtype: float64

In [116]:
city_data["employee_count"]

Amsterdam    5.0
Tokyo        8.0
Toronto      NaN
Name: employee_count, dtype: float64

In [119]:
toys = pd.DataFrame([
    {"name": "ball", "shape": "sphere"},
    {"name": "Rubik's cube", "shape": "cube"}
], index=["Alex", "Barbie"])

In [120]:
toys

                name   shape
Alex            ball  sphere
Barbie  Rubik's cube    cube

In [121]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [133]:
city_data.iloc[1:3]

         revenue  employee_count
Tokyo       6500             8.0
Toronto     8000             NaN

In [139]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [ ]:
.loc[["Tokyo", "Toronto"]]

In [ ]:
.loc["Tokyo":"Toronto"]

In [143]:
city_data.loc["Amsterdam"::2]

           revenue  employee_count
Amsterdam     4200             5.0
Toronto       8000             NaN

In [126]:
city_data.loc["Tokyo"]["employee_count"]

8.0

In [128]:
city_data["employee_count"].loc["Tokyo"]

8.0

In [129]:
city_data.loc["Tokyo", "employee_count"]

8.0

In [ ]:
city_data.loc["Tokyo", "employee_count":]

8.0

In [144]:
city_data.loc["Amsterdam"::2, "employee_count"]

Amsterdam    5.0
Toronto      NaN
Name: employee_count, dtype: float64

In [153]:
city_data["employee_count"].loc["Amsterdam"::2]

Amsterdam    5.0
Toronto      NaN
Name: employee_count, dtype: float64

In [154]:
df.loc[5555:5559, ["fran_id", "opp_fran", "pts", "opp_pts"]]

      fran_id  opp_fran  pts  opp_pts
5555  Pistons  Warriors   83       56
5556  Celtics    Knicks   95       74
5557   Knicks   Celtics   74       95
5558    Kings    Sixers   81       86
5559   Sixers     Kings   86       81

In [175]:
# select *
# from df
# where year_id > 2010
# and team_id = 'BOS'

df[(df["year_id"] > 2010) & (df["team_id"] == "BOS")]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
113657,56829,201010260BOS,NBA,0,2011,10/26/2010,1,0,BOS,Celtics,88,1625.10,1629.30,53.75,MIA,Heat,80,1547.36,1543.16,H,W,0.74,NaN
113663,56832,201010270CLE,NBA,1,2011,10/27/2010,2,0,BOS,Celtics,87,1629.30,1622.75,53.13,CLE,Cavaliers,95,1610.98,1617.53,A,L,0.38,NaN
113693,56847,201010290BOS,NBA,0,2011,10/29/2010,3,0,BOS,Celtics,105,1622.75,1624.36,53.28,NYK,Knicks,101,1430.52,1428.91,H,W,0.84,NaN
113750,56876,201011020DET,NBA,1,2011,11/2/2010,4,0,BOS,Celtics,109,1624.36,1634.18,54.21,DET,Pistons,86,1379.82,1370.00,A,W,0.70,NaN
113763,56882,201011030BOS,NBA,0,2011,11/3/2010,5,0,BOS,Celtics,105,1634.18,1636.18,54.40,MIL,Bucks,102,1506.21,1504.20,H,W,0.79,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
126141,63071,201504150MIL,NBA,1,2015,4/15/2015,82,0,BOS,Celtics,105,1543.86,1551.86,45.94,MIL,Bucks,100,1480.07,1472.07,A,W,0.45,NaN
126162,63082,201504190CLE,NBA,1,2015,4/19/2015,83,1,BOS,Celtics,100,1551.86,1546.22,45.36,CLE,Cavaliers,113,1630.62,1636.26,A,L,0.26,NaN
126173,63087,201504210CLE,NBA,1,2015,4/21/2015,84,1,BOS,Celtics,91,1546.22,1542.26,44.94,CLE,Cavaliers,99,1636.26,1640.22,A,L,0.25,NaN
126185,63093,201504230BOS,NBA,0,2015,4/23/2015,85,1,BOS,Celtics,95,1542.26,1533.12,43.99,CLE,Cavaliers,103,1640.22,1649.37,H,L,0.50,NaN
126205,63103,201504260BOS,NBA,0,2015,4/26/2015,86,1,BOS,Celtics,93,1533.12,1524.57,43.10,CLE,Cavaliers,101,1649.37,1657.91,H,L,0.48,NaN

In [173]:
# select *
# from (
#     select *
#     from df
#     where year_id > 2010
# ) as t
# where team_id = 'BOS'

df[df["year_id"] > 2010][df[df["year_id"] > 2010]["team_id"] == "BOS"]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
113657,56829,201010260BOS,NBA,0,2011,10/26/2010,1,0,BOS,Celtics,88,1625.10,1629.30,53.75,MIA,Heat,80,1547.36,1543.16,H,W,0.74,NaN
113663,56832,201010270CLE,NBA,1,2011,10/27/2010,2,0,BOS,Celtics,87,1629.30,1622.75,53.13,CLE,Cavaliers,95,1610.98,1617.53,A,L,0.38,NaN
113693,56847,201010290BOS,NBA,0,2011,10/29/2010,3,0,BOS,Celtics,105,1622.75,1624.36,53.28,NYK,Knicks,101,1430.52,1428.91,H,W,0.84,NaN
113750,56876,201011020DET,NBA,1,2011,11/2/2010,4,0,BOS,Celtics,109,1624.36,1634.18,54.21,DET,Pistons,86,1379.82,1370.00,A,W,0.70,NaN
113763,56882,201011030BOS,NBA,0,2011,11/3/2010,5,0,BOS,Celtics,105,1634.18,1636.18,54.40,MIL,Bucks,102,1506.21,1504.20,H,W,0.79,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
126141,63071,201504150MIL,NBA,1,2015,4/15/2015,82,0,BOS,Celtics,105,1543.86,1551.86,45.94,MIL,Bucks,100,1480.07,1472.07,A,W,0.45,NaN
126162,63082,201504190CLE,NBA,1,2015,4/19/2015,83,1,BOS,Celtics,100,1551.86,1546.22,45.36,CLE,Cavaliers,113,1630.62,1636.26,A,L,0.26,NaN
126173,63087,201504210CLE,NBA,1,2015,4/21/2015,84,1,BOS,Celtics,91,1546.22,1542.26,44.94,CLE,Cavaliers,99,1636.26,1640.22,A,L,0.25,NaN
126185,63093,201504230BOS,NBA,0,2015,4/23/2015,85,1,BOS,Celtics,95,1542.26,1533.12,43.99,CLE,Cavaliers,103,1640.22,1649.37,H,L,0.50,NaN
126205,63103,201504260BOS,NBA,0,2015,4/26/2015,86,1,BOS,Celtics,93,1533.12,1524.57,43.10,CLE,Cavaliers,101,1649.37,1657.91,H,L,0.48,NaN

In [177]:
np.nan

nan

In [185]:
df["notes"].notnull()

0         False
1         False
2         False
3         False
4         False
          ...
126309    False
126310    False
126311    False
126312    False
126313    False
Name: notes, Length: 126314, dtype: bool

In [187]:
df.loc[df["notes"].notnull(), ["game_id", "notes"]]

             game_id                                      notes
930     194801300BLB       at Baltimore's Fifth Regiment Armory
931     194801300BLB       at Baltimore's Fifth Regiment Armory
1084    194803230CHS                                 Tiebreaker
1085    194803230CHS                                 Tiebreaker
1088    194803250CHS                                 Tiebreaker
...              ...                                        ...
122207  201401160ATL                         at London, England
123916  201411120MIN  at Mexico City Arena, Mexico City, Mexico
123917  201411120MIN  at Mexico City Arena, Mexico City, Mexico
124862  201501150MIL                 at The O2, London, England
124863  201501150MIL                 at The O2, London, England

[5424 rows x 2 columns]

In [ ]:
map_typo = {'A': r'^ba.$', 'B': 'C'}

In [196]:
df.loc[df["notes"].notnull(), ["notes"]].replace(regex=r"Baltimore", value="Baltimoore")

                                            notes
930         at Baltimoore's Fifth Regiment Armory
931         at Baltimoore's Fifth Regiment Armory
1084                                   Tiebreaker
1085                                   Tiebreaker
1088                                   Tiebreaker
...                                           ...
122207                         at London, England
123916  at Mexico City Arena, Mexico City, Mexico
123917  at Mexico City Arena, Mexico City, Mexico
124862                 at The O2, London, England
124863                 at The O2, London, England

[5424 rows x 1 columns]